# Написать функцию, генерирующуhfkuhf,ю ровно 1<k<40 простых чисел и возвращающую их упорядоченный список.

def generate_primes(n):
    ...


if __name__ == '__main__':
    # Simple tests:
    print(generate_primes(4))  # [2,3,5,7]
    print(generate_primes(8))  # [2,3,5,7,11,13,17,19]
    print(generate_primes(-1))  # None
    print(generate_primes(3.5))  # None
